# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/services'
# tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
# brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
# brew 'stripe/stripe-cli/stripe'
# brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
# brew 'imagemagick'
brew 'yarn'
brew 'pnpm'
brew 'nvm'

# Apps
cask '1password'
brew '1password-cli'
cask 'caffeine'
cask 'discord'
# cask 'docker'
cask 'figma'
cask 'firefox'
cask "ghostty"
cask 'github'
cask 'google-chrome'
cask "http-toolkit"
cask 'imageoptim'
cask "insomnia"
# cask 'loom'
# cask 'pastebot'
# cask 'reflex'
# cask 'screen-studio'
cask 'slack'
# cask 'tableplus'
# cask 'telegram-desktop'
# cask 'the-unarchiver'
# cask 'tinkerwell'
# cask 'transmit'
# cask 'tunnelbear'
# cask 'tuple'
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "raycast"
cask 'visual-studio-code'
cask 'zoom'


# Quicklook
# cask 'qlmarkdown'
# cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono"

vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "james-yu.latex-workshop"
vscode "killidia.darcula-mono"
vscode "kingwl.vscode-vitest-runner"
vscode "maptz.camelcasenavigation"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mhutchie.git-graph"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "pmndrs.pmndrs"
vscode "redhat.vscode-yaml"
vscode "sdras.night-owl"
vscode "svelte.svelte-vscode"
vscode "thedavej.night-owl-black"
vscode "thislucas.grand-budapest-theme"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "yoavbls.pretty-ts-errors"

# Mac App Store
mas "1Password for Safari", id: 1569813296
mas "AdBlock Pro", id: 1018301773
# mas "Amphetamine", id: 937984704
mas "Free Ruler", id: 1483172210
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "Okta Verify", id: 490179405
mas "OneTab", id: 1540160809
mas "Pages", id: 409201541
mas "stoic", id: 1312926037
mas "Tailscale", id: 1475387142
mas "Tomato 2", id: 1494210770
